#1
number = input("number:")
for dight in str(number):
    print(dight)
#2
n = int(input("number: "))

while n >= 0:
    print(n)
    n -= 1

#3
i=1
while i<10000:
    print(i)
    i=i+2
#4
for n in range(2, 101, 2):
    print(n)
#5
# For და While ციკლები გვაძლევს საშუალებას, ერთი და იგივე მოქმედება გავიმეოროთ რამდენჯერმე.
# For ციკლი გამოიყენება, როცა წინასწარ ვიცით რამდენჯერ უნდა განმეორდეს რაღაც.
for i in range(5):   # For ციკლში "i" ცვლადი ყოველ ჯერზე იღებს ახალ რიცხვს (0-დან 4-მდე).
    print(i)         # ეს ციკლი დაბეჭდავს i-ს მნიშვნელობას (0, 1, 2, 3, 4).

# While ციკლი მუშაობს მანამ, სანამ პირობა მართალია.
i = 0                # ვიწყებთ i-ს 0-ით.
while i < 5:         # სანამ i ნაკლებია 5-ზე, ციკლი გრძელდება.
    print(i)         # ბეჭდავს i-ს.
    i += 1           # ყოველ ჯერზე i-ს ემატება 1, რათა ციკლი დროულად დასრულდეს.

# "i" ორივე შემთხვევაში არის "საიტერაციო ცვლადი" – ის ცვლადი, რომელიც ციკლში ყოველ ჯერზე იცვლება.
